# Урок 4 задание 6 часть б
# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,


import itertools
l = [1, 2, 3, 4, 5, 6, 7, 8, 9]
for i in itertools.cycle(l):
    print(i)
    if l.index(i) == len(l)-1:
        break



