# Урок 3 задание 4
# Программа принимает действительное положительное число x и целое отрицательное число y. Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

print("Программа возводит x в отрицательную степерь y")


def my_func(x, y):
    """Функция поиска двух наибольших значений из трех, далее происходит их сложение"""
    x = float(x)
    y = abs(int(y))
    z = x
    i = 1
    while i < y:
        z = x * z
        i = i + 1
    return 1 / z


peremen_x = input("Введите значение X: ")
peremen_y = input("Введите отрицательное значение Y: ")
print("ваш результат равен =", my_func(peremen_x, peremen_y,))

