# Урок 3 задание 1
# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.


print("Вы стартанули программу делитель.")


def delenie(a, b):
    """Производит деление двух переменных и делает проверку деления на ноль"""
    if b == 0:
        return "на 0 делить нельзя!"
    else:
        return a / b


delim = float(input("введите делимое: "))
delit = float(input("введите делитель: "))
print(delenie(delim, delit))
