# Урок 2 задание 2
# Для списка реализовать обмен значений соседних элементов, т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д. При нечетном количестве элементов последний сохранить на своем месте. Для заполнения списка элементов необходимо использовать функцию input().

list_a = input("Введите список значений(цифры либо буквы) через пробел, сейчас будет колдунство ")
list_a = list_a.split()
print(list_a)
f = len(list_a)
f = f // 2
i = 0
while i < f*2:
    buf = list_a[i]
    list_a[i] = list_a[i+1]
    list_a[i+1] = buf
    i = i + 2
print(list_a)
