# -*- coding: utf-8 -*-
# Урок 5 задание 6
# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.

import re

subj = {}
with open('file_task6.txt', 'r') as in_file:
    for line in in_file:
        (key, val) = line.split()[0].replace(":", ""), sum([int(i) for i in re.findall(r"\d+", line)])
# в кортеж получаем название предмета, убирав после ":"  - line.split()[0].replace(":", "")
# находим все цыфры в строке и возвращаем писок  - re.findall(r"\d+", line)
# пересоздаем полученный список в числовом формате  - int(i)...
# складываем все полученные значения  - sum(...
        subj[key] = val
print(subj)
