# Урок 8 задание 3
# Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел. Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список. Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список выводится на экран.

class NonIntegerValue(Exception):
    pass


if __name__ == '__main__':
    print("Для выхода введите: stop")
    l = []
    val = ""
    while True:
        val = input("Введите число: ")
        if val == "stop":
            break
        else:
            try:
                if not val.isdigit():
                    raise NonIntegerValue("Вы ввели не число")
            except NonIntegerValue as exc:
                print(exc)
            else:
                v = int(val)
                l.append(v)
    print(l)