# Урок 3 задание 5
# Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается. Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.


print("Программа бесконечный складыватель, если надоело введи стоп слово 'stop' :)")


def plusing():
    """функция суммирует циклично последовательсности и останавливается по слову stop
    не вводите ничего кроме числовых значений через пробел и слова stop
    в функции не предусмотрена проверка, и если вы введете что то не то, все развалится"""
    c = 0
    while True:
        print("Введите последовательность значений через пробел:")
        a = input()
        a = a.split()
        b = len(a)
        i = 0
        while i < b:
            if a[i] != "stop":
                c = c + float(a[i])
                i = i + 1
            else:
                return c
                break
        print("промежуточное значние =", c)


znach = plusing()
print(znach)
