# -*- coding: utf-8 -*-
# Урок 4 задание 1
# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника. В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.


def zar_plat(v, s, p):
    return int(v) * int(s) + int(p)


from sys import argv


arg_n, arg_v, arg_s, arg_p = argv
print(zar_plat(arg_v,arg_s,arg_p))



