# Урок 1 Задание 6
# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего. Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров. Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

print("Вы запустили программу AmazНедоFit треккер, заставляет бегать на 10% в день больше")
a = int(input("Введите значение, сколько готовы пробежать в день: "))
b = int(input("Введите значение сколько хотите пробегать в день: "))
day = 1
while b > a:
    a = a / 100 * 110
    day = day + 1

print("на", day ,"день достигнет цели")