# Урок 1 Задание 5
#Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек, или убыток — издержки больше выручки). Выведите соответствующее сообщение. Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке). Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

print("Вы запустили программу 1с курит в сторонке - версия корп")
vyruch = int(input("Введите значение выручки: "))
izderg = int(input("Введите значение издержек: "))
finres = vyruch - izderg
if finres <= 0:
    print("Закрывай контору, делов не будет")
else:
    print("Ваша прибыль составила", finres, "рубленных")
    sotrud = int(input("Введите число со сколькими сотрудниками вы поделитесь: "))
    korm = finres / sotrud
    print("Каждый кому положено получит", korm, "рубленных")