# Урок 1 Задание 4
#Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

print("Вы запустили программу поиска самой большой цыфры в вашем числе")
znach = input("Введите значение для расчета положительное цело число: ")
max = 0
i = 0
while i < len(znach):
    if int(znach[i]) > max:
        max = int(znach[i])
    i+=1

print("Самая большая цифра в этом чсиле", max)

