# Урок 6 задание 2
# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина). Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна. Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.

class Road:
    def __init__(self, length, width):
        self._length = length
        self._widdth = width

    def calculate(self, mass, deph):
        val = (self._length * self._widdth * mass * deph) // 1000
        print("{} {} т".format("Необходимо: ", val))

if __name__ == "__main__":
    rd = Road(20, 5000)
    rd.calculate(25, 5)