# -*- coding: utf-8 -*-
# Урок 4 задание 6 часть а
# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

#было решено что первое значение запрашивается согласно условию а условие по которому предусмотрен выход будет так же запрашиваться
import itertools
from sys import argv
n, f, l = argv
f = int(f)
l = int(l)
for i in itertools.count(f,1):
    if i > l:
        break
    print(i)

