# Урок 3 задание 3
# Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.


print("Программа складывает два наибольших числа из 3 значений и слкадывает их используя функцию")


def my_func(a, b, c):
    """Функция поиска двух наибольших значений из трех, далее происходит их сложение"""
    a = float(a)
    b = float(b)
    c = float(c)
    if a <= b and a <= c:
        return b + c
    elif b <= a and b <= c:
        return  a + c
    elif c <= a and c <= b:
        return a + b


peremen_a = input("Введите первую переменную: ")
peremen_b = input("Введите вторую переменную: ")
peremen_c = input("Введите третью переменную: ")
print("ваш результат равен =")
print(my_func(peremen_a, peremen_b, peremen_c))
