# Урок 1 Задание 1
# Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

per_one = 1
per_two = 2
per_res = per_one + per_two
print(per_res, "глаз")
str_one = "Настрадамус"
print(str_one)
name = input("Введите имя: ")
yage = int(input("Введите год рождения в формате ГГГГ: "))
year = int(input("Введите текущий год в формате ГГГГ: "))
age = year - yage
print("Настрадамус говорит что тебе",name, age, "лет" )

