# Урок 2 задание 5
# Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.

print("Мы сейчас вставим куда надо...")
my_list = [7, 5, 3, 3, 2]
print(my_list)
#print(len(my_list))
a = int(input("Введите значение от 0 до 9 "))

for i in range(len(my_list)):
    if (my_list[i]<=a):
        my_list.insert(i, a)
        break
    if(i == len(my_list) -1 ):
        my_list.append(a)
        break
print("Вставляем!")

print(my_list)

