# Урок 2 задание 4
# Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки. Строки необходимо пронумеровать. Если в слово длинное, выводить только первые 10 букв в слове.

list_a = input("Введите список слов через пробел для получения чудо-реультата ")
list_a = list_a.split()
f = len(list_a)
i = 0
while i < f:
    list_b = list_a[i]
    print(i+1, "-", list_b[:10])
    i = i + 1
