# Урок 3 задание 2
# Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия, год рождения, город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы. Реализовать вывод данных о пользователе одной строкой.


print("Программа использует функцию для сбора строки")


def zap_struk (a, b, c, d, e, f):
    """Имя : Фамилия : Год_Р : Город : Почта : Телефон"""
    return a + " : " + b + " : " + c + " : " + d + " : " + e + " : "  + f


fname = input("Введите имя: ")
lname = input("Введите фамилию: ")
age = input("Ввдеите год рождения: ")
lsity = input("Введите город проживания: ")
mail = input("Введите электронную почту: ")
phone = input("Введите номер телефона: ")
print("ваш результат строки:")
print(zap_struk.__doc__)
print(zap_struk(e=mail, f=phone, d=lsity, a=fname, b=lname, c=age))