# Урок 3 задание 1
# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление. Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.


print("Вы стартанули программу делитель.")


def delenie(delim, delit):
    """Производит деление двух переменных и делает проверку деления на ноль"""
    if delit == 0:
        return "на 0 делить нельзя!"
    else:
        return delim / delit


delim = float(input("введите делимое: "))
delit = float(input("введите делитель: "))
print(delenie(delim,delit))
