# Урок 2 задание 1
# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

print("вы сейчас увидите расшифровку данного списка")
list = (1, 2.5, "word", True, [1,34,4])
print(list)
print("данный список имеет тип", type(list))
print("элементы данного списка имеют следующие типы")
i = 0
f = len(list)
while i < f:
    print(i+1, type(list[i]))
    i = i + 1